Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: ཁམས་གསུམ་ཀུན་གྱི་འགྲོ་ལ་ཕན་པའི་ཕྱིར། །རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་པར་འགྱུར། །
en: “For the benefit all beings in the three realms The relics of this victor will be abundant.

source: སངས་རྒྱས་ཡོན་ཏན་ཕུང་པོ་སྐྱེ་བའི་ཡུལ། །ཡོན་ཏན་ཐམས་ཅད་འབྱུང་བའི་གནས་ཞེས་བྱ། །
en: The buddha Guṇarāśi Will be born in a place called Source of All Good Qualities.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ལྷ་ཡི་རྫུ་འཕྲུལ་ཡབ། །རྫུ་འཕྲུལ་འགྲོས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend one hundred leagues. Divine Miracle will be his father, and Miraculous Mode will be this victor’s mother.

source: སྲས་པོ་རྣམ་སྒྲོགས་དྲག་ཤུལ་རིམ་གྲོ་པ། །
en: Proclaim will be his son and Fierce his attendant.

source: ཡོན་ཏན་སྒྲོན་མའི་མཆོག་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme Lamp of Qualities the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་དྲུག་ཀུན་ལའང་། །སྲིད་གསུམ་འདམ་གྱིས་གོས་པ་མེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་བཞི་བཞི་ཡོད། །
en: There will be seventy-six consecutive congregations, Each of them gathering nine hundred forty million “Who are unstained by the mud of the three worlds.

source: རྒྱལ་བ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲི་བརྒྱད་སྟོང་བར་དུ་གནས། །
en: And when this victor has attained nirvāṇa His sacred Dharma will also remain for seventy-eight thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ནི། །བཅུ་གཉིས་པ་གཅིག་ལྷ་རྫས་བླ་རེར་ལྡན། །
en: “The single stūpa containing the relics of this victor Will be twelve leagues large and adorned with canopies of heavenly substance.

source: འཇིག་རྟེན་བླ་མ་གསལ་བ་སྐྱེ་བའི་ཡུལ། །འཇིགས་པ་མེད་པའི་བསོད་ནམས་ཞེས་ཀྱང་བྱ། །
en: The world’s teacher, Prasanna, Will be born in a place called Fearless Merit.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གཉིས་གྲགས་པའི་དབང་པོ་ཡབ། །ལྷ་གྲགས་འཛིན་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend thirty-two leagues. Master of Fame will be his father, and Possessor of Divine Fame will be this victor’s mother.

source: སྲས་པོ་གྲགས་འཛིན་ཟླ་སྡུག་རིམ་གྲོ་པ། །
en: Famed will be his son and Beautiful Moon his attendant.

source: སྙན་པར་གྲགས་པ་ཐོབ་པ་བློ་ཅན་ཏེ། །
en: “Possessor of Divine Fame will be the one of intelligence

source: སྙན་པར་གྲགས་པ་གསལ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Clear Fame the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །འཇིག་རྟེན་དག་གིས་མཆོད་འོས་དགྲ་བཅོམ་པ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་བཅུ་བཅུ་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering one trillion “Worthy ones who are rightly worshiped by the world.

source: སེམས་ཅན་སྙིང་པོའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བྱེ་བ་ཉི་ཤུ་གཉིས་སུ་གནས། །
en: And the sacred Dharma that is essential to sentient beings Will remain for two hundred twenty million years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་དེ་ཀུན་རིན་ཆེན་བདུན་ལས་བྱས། །
en: “The relics of this victor will be abundant, Residing in stūpas made of the seven precious substances.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་རྒྱལ་མཚན་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་ཚོགས་ཞེས་བྱ། །
en: The thus-gone Dharmadhvaja Will be born in a place called Gathering of Wisdom.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཉི་ཤུ་ཡབ་ནི་མྱ་ངན་མེད། །རིན་ཆེན་རྒྱལ་མཚན་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend twenty leagues. Free from Suffering will be his father, and Jewel Banner will be this victor’s mother.

source: སྲས་པོ་ཤེས་མཆོག་འཕགས་པ་རིམ་གྲོ་པ། །
en: Supreme Knowledge will be his son and Noble his attendant.

source: བདུད་རྩིའི་རྒྱལ་མཚན་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Nectar Banner will be the scholar

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་གཉིས་ཀུན་ལའང་། །འཇིག་རྟེན་ཆོས་བརྒྱད་དག་ལས་གྲོལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བདུན་ཅུ་ཡོད། །
en: There will be twenty-two consecutive congregations, Each of them gathering seven hundred million “Who are free from the eight worldly concerns.

source: དམ་ཆོས་ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས། །
en: And the sacred Dharma will also remain for eighty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་གི་མཆོད་རྟེན་ནི། །དཔག་ཚད་བཅུ་པ་གཅིག་སྟེ་གདུགས་ཀྱི་གྲངས། །སྟོང་ཕྲག་བདུན་ཅུ་སྙེད་ཀྱིས་རྣམ་པར་བརྒྱན། །
en: The stūpa with the relics of this victor “Will be eleven leagues large And adorned with seventy thousand parasols.

source: སངས་རྒྱས་ཡེ་ཤེས་ང་རོ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ཡེ་ཤེས་རབ་ཏུ་གནས་ཞེས་བྱ། །
en: The buddha Jñānaruta Will be born in a place called Enduring Wisdom.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ཡོན་ཏན་མཆོག །གཙོ་འོད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend one hundred leagues. Supreme Qualities will be his father, and Radiant Leader will be this victor’s mother.

source: སྲས་པོ་སྡེ་བཟངས་ཁྱད་འཕགས་རིམ་གྲོ་པ། །
en: Excellent Faction will be his son and Distinguished his attendant.

source: ཆོས་ཀྱི་སྒྲ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Sound of Dharma will be the scholar

source: ཐར་པའི་སྒྲ་དབྱངས་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Melody of Liberation the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ལྔ་ཀུན་ལའང་། །དགྲ་བཅོམ་བྱས་བསྲུངས་ཤེས་རབ་རྣམ་གྲོལ་བ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be seventy-five consecutive congregations, Each of them gathering nine hundred twenty million “Worthy ones whose acts are guarded and insight free.

source: གྲགས་པ་མཐའ་ཡས་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སྟོང་དུ་གནས་པར་འགྱུར། །
en: And when this being of infinite renown has attained nirvāṇa His sacred Dharma will remain for one thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་སྟོང་སྙེད་ཀྱིས་གང་བར་འགྱུར། །
en: “The relics of this victor will be abundant, Residing in ten billion stūpas.

source: འཇིག་རྟེན་མཆོག་མ་ནམ་མཁའ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་གཟི་བརྗིད་སྒྲོན་མ་ཞེས་ཀྱང་བྱ། །
en: The one who is supreme in the world, Gagana, Will be born in a place called Lamp of Splendor.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་བཞི་ཡབ་ནི་རི་དབང་ཡིན། །འགྲོས་བརྟན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend fourteen leagues. Majestic Mountain will be his father, and Stable Mode will be this victor’s mother.

source: སྲས་པོ་གནས་མེད་ཐོགས་མེད་རིམ་གྲོ་པ། །
en: Unsupported will be his son and Unimpeded his attendant.

source: གནས་ལ་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Joyous Abiding will be the scholar

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །སྲིད་པ་ཀུན་ནས་གྲོལ་བའི་ཡིད་ལྡན་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་བཞི་བཞི་ཡོད། །
en: There will be sixty-six consecutive congregations, Each of them gathering nine hundred forty million “Whose minds are completely liberated from existence.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱད་པ་གསེར་གྱི་བླ་རེ་ལྡན། །
en: “The relics of this victor will reside in a single stūpa Eight leagues large and adorned with golden canopies.

source: སངས་རྒྱས་མཆོད་སྦྱིན་ང་རོ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ཆོས་རྣམས་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: The buddha Yajñasvara Will be born in a place called Illuminating the Teachings.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་ལྔ་ཡོད་ཡབ་ནི་སྒྲོན་མ་ཡིན། །ཡོན་ཏན་གདངས་སྙན་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be kṣatriya, And his light will extend five leagues. Lamp will be his father, and Melody of Excellent Qualities will be this victor’s mother.

source: སྲས་པོ་སྦྲང་རྩི་སྐད་སྙན་རིམ་གྲོ་པ། །
en: Honey will be his son and Beautiful Voice his attendant.

source: སྤོབས་པའི་དབྱངས་ནི་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: “Melody of Acumen will be the one of intelligence

source: དབྱངས་མཆོག་མཐའ་ཡས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Infinite Supreme Melody the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །རྣམ་ཐར་བརྒྱད་ཀྱི་ཕ་མཐར་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering nine hundred twenty million “Who have perfected the eight liberations.

source: ཞི་བར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དགུ་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: And the sacred Dharma of the one gone to peace Will remain for ninety-two thousand years.

source: སངས་རྒྱས་ཤེས་རབ་རྣམ་འགོད་ང་རོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོག་ཏུ་དགའ་ཞེས་བྱ། །
en: The buddha Jñāna­vihāsa­svara Will be born in a place called Supremely Joyous.

source: བདེ་བར་གཤེགས་པའི་རིགས་ནི་རྒྱལ་རིགས་ཡིན། །འོད་ནི་སྟོང་གསུམ་ཚད་ཙམ་བློ་བཟངས་ཡབ། །དེས་པའི་སྒྲ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this well-gone one will be kṣatriya, And his light will extend as far as the trichiliocosm. Excellent Mind will be his father, and Sound of Certainty will be this victor’s mother.

source: སྲས་པོ་སྣང་བྱེད་ལྷ་ནི་རིམ་གྲོ་པ། །
en: Illuminator will be his son and God his attendant.

source: བལྟ་ན་སྡུག་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Beautiful to Behold will be the scholar

source: རྣམ་པར་སྣང་བྱེད་ལྷ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Illuminator the one of miracles.

source: འདུས་པ་དག་ནི་མཐའ་ཡང་ཡས་པ་སྟེ། །གཟུངས་རྣམས་ཐོབ་པ་ཕྱིར་ནི་མི་ལྡོག་པ། །བྱང་ཆུབ་སེམས་དཔའི་འཁོར་རྣམས་འབྱུང་བར་འགྱུར། །
en: There will be infinitely many congregations As he will be surrounded by irreversible bodhisattvas “Who have accomplished retention.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་བརྒྱད་འབུམ་ཡིན། །
en: The lifespan of humans will be eight hundred thousand years,

source: བྱང་ཆུབ་བསྲུང་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བརྒྱད་འབུམ་བར་དུ་གནས་པར་འགྱུར། །
en: And to protect awakening his sacred Dharma Will remain for eight hundred thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་རྒྱས་འགྱུར་ཞིང་རྣམས་གང་། །གསེར་རྒྱན་བྱེ་བ་དག་གིས་བརྒྱན་པར་འགྱུར། །
en: “The relics of this victor will be abundant, Filling the realms and decorated with gold ornaments.

source: སངས་རྒྱས་ཡོན་ཏན་འོད་ཟེར་གཟི་བརྗིད་ཀྱི། །སྐྱེ་ཡུལ་ཡོན་ཏན་ཀུན་དང་ལྡན་ཞེས་བྱ། །
en: The buddha Guṇatejoraśmi Will be born in a place called Endowed with All Excellent Qualities.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གཉིས་ཡབ་ནི་ཡོན་ཏན་འོད། །ཡོན་ཏན་འོད་བཟངས་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །ཡོན་ཏན་རྒྱ་མཚོ་ཟླ་བ་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend thirty-two leagues. Luminous Qualities will be his father, and Excellent Luminous Qualities will be this victor’s mother. Ocean of Qualities will be his son and Moon his attendant.

source: ཟླ་བ་འཕགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Superior Moon will be the scholar

source: ཡོན་ཏན་མཆོག་གིས་མཆོད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Worship through Supreme Qualities the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །ཡོན་ཏན་ཀུན་གྱི་ཕ་རོལ་ཕྱིན་པ་པོ། །ཐེར་འབུམ་ཐེར་འབུམ་དག་ནི་འདུས་པར་འགྱུར། །
en: There will be sixty-six consecutive congregations, Each of them gathering one billion “Who have perfected all excellent qualities.

source: འགྲོ་ལ་ཕན་ཕྱིར་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སྟོང་དུ་གནས་པར་འགྱུར། །
en: And for the benefit of wandering beings The sacred Dharma will remain for one thousand years.

source: མི་ཡི་འདྲེན་པ་དྲང་སྲོང་དབང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འཕགས་པས་བལྟས་ཞེས་བྱ། །
en: The guide of humans, Ṛṣīndra, Will be born in a place called Beheld by the Noble.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་གསུམ་ཡབ་ནི་གསལ་བ་ཡིན། །འཕགས་མཉམ་མ་ནི་རྒྱལ་ཡུམ་དྲང་སྲོང་བྱིན། །སྲས་ཡིན་འཕགས་པའི་མེ་ཏོག་རིམ་གྲོ་པ། །
en: “His family will be brahmin, And his light will extend seventy-three leagues. Luminous will be his father, and Noble Equality will be this victor’s mother. Sage Gift will be his son and Superior Flower his attendant.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་གསུམ་ཀུན་ལའང་། །མིང་རྣམས་གསལ་ཞིང་མདུད་པ་སྤངས་པ་པོ། །བྱེ་བ་སྟོང་ཕྲག་དག་ནི་གསུམ་གསུམ་ཡོད། །
en: There will be twenty-three consecutive congregations, Each of them gathering thirty billion “Who dispel the names and relinquish the knots.

source: མཐའ་ཡས་འདུལ་བར་མཛད་པའི་དམ་ཆོས་དག །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: And the sacred Dharma of this tamer of infinite beings Will also remain for eighty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱད་པ་ནོར་བུས་རྣམ་པར་སྤྲས། །
en: “The relics of this victor will reside in a single stūpa Eight leagues large and studded with jewels.

source: མི་ཡི་འདྲེན་པ་བློ་དང་ལྡན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མཛངས་པས་བལྟས་ཞེས་བྱ། །
en: The guide of humans, Matimat, Will be born in a place called Beheld by the Astute.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་དྲན་ལྡན་ཡིན། །དགེ་བའི་ང་རོ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be kṣatriya, And his light will extend one hundred leagues. Mindful will be his father, and Roar of Virtue will be this victor’s mother.

source: སྲས་པོ་མེ་ཏོག་མཁས་པ་རིམ་གྲོ་པ། །
en: Flower will be his son and Expert his attendant.

source: ཡོན་ཏན་ཁ་ལོ་སྒྱུར་བ་བློ་ཅན་ཏེ། །
en: “Leader Qualities will be the one of intelligence

source: ཕན་འདོད་མཐའ་ཡས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Infinite Wish to Benefit the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱ་སྟེ་ཀུན་ལ་ཡང་། །སྲིད་པ་སྤངས་པའི་སེམས་དང་ལྡན་པ་པོ། །དེ་དག་ཐེར་འབུམ་ཕྲག་ནི་བཅུ་བཅུ་ཡོད། །
en: There will be one hundred consecutive congregations, Each of them gathering ten billion “Endowed with the mind that has relinquished existence.

source: སྣང་མེད་ཐོབ་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སྟོང་གི་བར་དུ་གནས། །
en: And after this teacher who has attained nonappearance has attained nirvāṇa His sacred Dharma will remain for one thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་དགུ་བཅུ་འབྱུང་། །
en: “The relics of this victor will be abundant, And there will appear ninety billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་སྤོབས་པའི་ཚོགས་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོད་ཅིང་བསྒོམས་ཞེས་བྱ། །
en: The thus-gone Pratibhānagaṇa Will be born in a place called Worship and Meditation.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །དགུ་བཅུ་གསུམ་ཡོད་ཡབ་ནི་རྟོགས་ལྡན་ཡིན། །ཡེ་ཤེས་སྟོབས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend ninety-three leagues. Endowed with Realization will be his father, and Strength of Wisdom will be this victor’s mother.

source: སྲས་པོ་འཕགས་པ་དགྲ་བཅོམ་རིམ་གྲོ་པ། །
en: Noble will be his son and Worthy his attendant.

source: ཡོན་ཏན་ཕུང་པོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Heap of Qualities will be the scholar

source: ཡེ་ཤེས་ཡོན་ཏན་འབྱུང་གནས་རྫུ་འཕྲུལ་ཅན། །
en: And Source of the Qualities of Wisdom the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །འགྲོ་བའི་མཆོག་ལ་དགའ་བའི་དགྲ་བཅོམ་པ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་རེ་རེ་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering three hundred million worthy ones “Who delight in the supreme among beings.

source: མི་ཚེ་ལོ་གྲངས་ཉིས་ཁྲི་ཉིས་སྟོང་ཡིན། །
en: The lifespan of humans will be twenty-two thousand years,

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: And after this teacher has attained parinirvāṇa His sacred Dharma will remain for seventy-six thousand years.

source: འཇིག་རྟེན་མཆོག་མ་མཆོད་སྦྱིན་བཟང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མཆོད་སྦྱིན་གསལ་ཞེས་བྱ། །
en: The one supreme in the world, Suyajña, Will be born in a place called Luminous Sacrifice.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་ལྔ་མཆོད་སྦྱིན་བཟང་པོ་ཡབ། །ཐར་པའི་ང་རོ་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །བསོད་ནམས་འབྱུང་གནས་རྒྱལ་བ་རིམ་གྲོ་པ། །
en: “His family will be brahmin, And his light will extend thirty-five leagues. Excellent Sacrifice will be his father, and Roar of Liberation will be this victor’s mother. Source of Merit will be his son and Victorious his attendant.

source: ངེས་པས་བྱས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Done with Certainty will be the scholar

source: འཇིགས་པ་མེད་པའི་སྟོབས་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Fearless Strength the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་ཐམས་ཅད་ཆགས་པ་མེད་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གསུམ་གསུམ་ཡོད། །
en: There will be seventy consecutive congregations, Each of them gathering seven hundred thirty million “Worthy ones who are all free from attachment.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་ལྔ་སྟོང་བར་དུ་གནས་པར་འགྱུར། །
en: And after this teacher has attained parinirvāṇa His sacred Dharma will remain for five thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་སྟོང་གིས་འཁོར་བར་བསྐོར། །
en: “The relics of this victor will be abundant, And ten billion stūpas will enshrine them.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་ཞལ་སྐྱེ་བའི། །ཡུལ་ནི་རྣམ་པར་སྣང་བྱེད་ལྷ་ཞེས་བྱ། །
en: The thus-gone Candrānana Will be born in a place called Divine Illumination.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཅུ་ཡབ་ནི་ཡུལ་འཁོར་བཟང་། །ཡུལ་འོད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend seventy leagues. Excellent Land will be his father, and Land of Light will be this victor’s mother.

source: སྲས་པོ་ལེགས་མཐོང་ཕན་འདོད་རིམ་གྲོ་པ། །
en: Excellent Sight will be his son and Wish to Benefit his attendant.

source: མེ་ཏོག་འབྱུང་གནས་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Source of Flowers will be the scholar

source: སྣང་བར་བྱེད་པའི་ལྷ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And God of Illumination the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཐེག་པ་མཆོག་གིས་རྣམ་པར་གྲོལ་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གསུམ་གསུམ་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering two hundred thirty million “Who have attained liberation by means of the supreme vehicle.

source: གྲགས་པ་མཐའ་ཡས་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སྟོང་གི་བར་དུ་གནས། །
en: And after this teacher of infinite fame has attained nirvāṇa His sacred Dharma will remain for one thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཤིན་ཏུ་གཟིགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སྐར་མ་སྣང་ཞེས་བྱ། །
en: The thus-gone Sudarśana Will be born in a place called Starlight.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་རི་དབང་ཡིན། །འོད་མཐའ་ཡས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend one hundred leagues. Majestic Mountain will be his father, and Limitless Light will be this victor’s mother.

source: སྲས་པོ་ཁ་སྒྱུར་པད་མ་རིམ་གྲོ་པ། །
en: Leader will be his son and Lotus his attendant.

source: དགའ་བའི་དབྱངས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Melody of Joy will be the scholar

source: ཡོན་ཏན་མཆོག་གསལ་བ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Luminous Supreme Qualities the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་སྟེ་ཀུན་ལ་ཡང་། །ཐེག་པ་མཆོག་གིས་གཏི་མུག་མེད་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: There will be ten consecutive congregations, Each of them gathering two hundred twenty million “Who have become free from dullness by means of the supreme vehicle.

source: མི་ཀུན་ཚེ་ལོ་བརྒྱ་ནི་སུམ་ཅུ་ཡིན། །
en: The lifespan of humans will be three thousand years,

source: རྒྱལ་བའི་སྐུ་གདུང་དག་གི་མཆོད་རྟེན་ནི། །དཔག་ཚད་བཅུ་དྲུག་པ་གཅིག་གསེར་གྱིས་སྤྲས། །
en: “The stūpa with relics of this victor Will be sixteen leagues large and adorned with gold.

source: ཡོན་ཏན་རྒྱ་མཚོ་རྡུལ་དང་བྲལ་བ་ཡི། །སྐྱེ་ཡུལ་ཡོན་ཏན་ཀུན་དང་ལྡན་ཞེས་བྱ། །
en: The ocean of qualities, Viraja, Will be born in a place called Endowed with All Qualities.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་བཞི་ཡོན་ཏན་དབང་པོ་ཡབ། །ཡོན་ཏན་བདེན་འཛིན་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be kṣatriya, And his light will extend twenty-four leagues. Ruler Qualities will be his father, and Holder of True Qualities will be this victor’s mother.

source: སྲས་པོ་བཟང་ལྡན་ལེགས་སེམས་རིམ་གྲོ་པ། །
en: Endowed with Excellence will be his son and Excellent Mind his attendant.

source: སྟོབས་བཅུའི་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Light of the Ten Powers will be the scholar

source: ཚོགས་དབང་འོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Light of the Master of Gathering the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །འཇིག་རྟེན་ཆོས་དང་མཚུངས་མེད་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་ལྔ་ལྔ་ཡོད། །
en: There will be ninety consecutive congregations, Each of them gathering nine hundred fifty million “Meditators who are free from mundane concerns.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་སུམ་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: And after this teacher has attained parinirvāṇa His sacred Dharma will remain for thirty thousand years.

source: འགྲོ་ལ་ཕན་ཕྱིར་རྒྱལ་བའི་སྐུ་གདུང་དག །ཞིང་རྣམས་དག་ཏུ་རྒྱས་ཤིང་གང་བར་འགྱུར། །
en: “For the sake of beings, the relics of this victor Will be abundant, filling the realms.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཚོགས་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་གྲགས་པ་མཆོག་ཅེས་བྱ། །
en: The thus-gone Guṇasañcaya Will be born in a place called Supreme Fame.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་སུམ་ཅུ་ཡབ་ནི་ཡོན་ཏན་འོད། །ཡོན་ཏན་གཟི་བརྗིད་འཛིན་པ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be kṣatriya, And his light will extend thirty leagues. Luminous Qualities will be his father, and Holder of the Qualities of Splendor will be this victor’s mother.

source: སྲས་པོ་མཆོད་རྟེན་ལེགས་སྤྱད་རིམ་གྲོ་པ། །
en: Stūpa will be his son and Excellent Conduct his attendant.

source: སྐད་སྙན་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Beautiful Voice will be the scholar

source: འཇིགས་པ་མེད་པའི་ཟླ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Moon of Fearlessness the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །ཆོས་ཀྱི་མཆོག་མ་ཐོབ་པ་དགྲ་བཅོམ་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: There will be seventy consecutive congregations, Each of them gathering two hundred twenty million worthy ones “Who have attained supreme qualities.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་ལྔ་པ་རྒྱལ་མཚན་མཆོག་གིས་སྤྲས། །
en: “The relics of this victor will reside in a single stūpa Five leagues large and adorned with supreme banners.

source: མི་ཡི་འདྲེན་པ་ཏོག་དང་ལྡན་པ་ཡི། །སྐྱེ་ཡུལ་ཏོག་ནི་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: The guide of humanity, Ketumat, Will be born in a place called Illumination.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་བློ་གྲོས་ཅན། །ཡོན་ཏན་མིག་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །སྐལ་ལྡན་ཤིང་རྟ་འབྱོར་པ་རིམ་གྲོ་པ། །
en: “The family of this victor will be kṣatriya, And his light will extend nine leagues. Intelligent will be his father, and Eye of Qualities will be this victor’s mother. Chariot of Fortune will be his son and Wealth his attendant.

source: ཡེ་ཤེས་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Light of Wisdom will be the scholar

source: རིན་ཆེན་འོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Jewel Light the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་ཀུན་ལ་ཡང་། །ཡོན་ཏན་མཆོག་གི་ཕ་རོལ་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བཅུ་གཉིས་བཅུ་གཉིས་ཡོད། །
en: There will be sixty consecutive congregations, Each of them gathering one hundred twenty million “Who have perfected supreme qualities.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །གསེར་གྱི་རྒྱལ་མཚན་མཆོག་བརྒྱས་རྣམ་པར་བརྒྱན། །
en: “The relics of this victor will be abundant And adorned with supreme golden banners.

source: དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་རྒྱལ་མཚན་གྱི། །སྐྱེ་ཡུལ་ཡེ་ཤེས་རྣམ་པར་སྤྲུལ་ཅེས་བྱ། །
en: The thus-gone Puṇyadhvaja Will be born in a place called Emanations of Wisdom.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་གཉིས་ཡབ་ནི་བློ་གྲོས་ལྡན། །བལྟ་བཟོད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend seventy-two leagues. Intelligent will be his father, and Accepting the View will be this victor’s mother.

source: སྲས་པོ་རྩི་སྨན་མདངས་བཟངས་རིམ་གྲོ་པ། །
en: Elixir will be his son and Excellent Brightness his attendant.

source: ཆོས་ཀྱི་འབྱུང་གནས་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Source of Dharma will be the scholar

source: འཇིག་རྟེན་གཞོལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Facing the World the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །འཇིག་རྟེན་ཟང་ཟིང་མེད་པའི་དགྲ་བཅོམ་པ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་གཉིས་གཉིས་ཡོད། །
en: There will be seventy consecutive congregations, Each of them gathering two hundred billion worthy ones “Who are free from the business of the world.

source: མྱ་ངན་འདས་པ་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: And after this teacher has attained nirvāṇa His sacred Dharma will remain for ninety thousand years.
